// "ADD" বাটনে ক্লিক করলে নতুন টুডু আইটেম যোগ করা হবে
$('.add-btn').click(function(){
    // ইনপুট ফিল্ডের মান নিয়ে নতুন টুডু আইটেম লিস্টে অ্যাড করা হবে
    $('ul').append("<li><span><i class='fa fa-trash'></i></span>"+ $('input').val() +"</li>");
    // নতুন টুডু আইটেম যোগ করার পর ইনপুট ফিল্ডটি ক্লিয়ার করা হবে
    $('input').val("");
 });
 
 // ট্র্যাশ আইকনে ক্লিক করলে টুডু আইটেমটি মুছে যাবে
 $('ul').on("click", 'span', function(){
    // ক্লিক করা আইটেমটি ফেইডআউট হবে এবং পরে রিমুভ হবে
    $(this).parent().fadeOut(500,function(){
       $(this).remove();
    });
 });
 
 // আইকনে ক্লিক করলে ইনপুট ফিল্ডটি শো/হাইড হবে
 $('.icon').click(function(){
    // ইনপুট ফিল্ডটি শো/হাইড করতে "hide" ক্লাসটি টগল করা হবে
    $('.field').toggleClass("hide");
 });
 